plugin -i slang
read_slang --top top --ignore-unknown-modules --keep-hierarchy   /home/jonathan/OpenROAD-flow-scripts/tools/install/yosys/share/yosys/xilinx/cells_sim.v /home/jonathan/OpenROAD-flow-scripts/tools/install/yosys/share/yosys/xilinx/cells_xtra.v   /home/jonathan/v7-johnson-demo/ethsoc/arp_ctrl.sv /home/jonathan/v7-johnson-demo/ethsoc/framing_top_sgmii.sv /home/jonathan/v7-johnson-demo/ethsoc/sgmii_soc.sv /home/jonathan/v7-johnson-demo/ethsoc/eth_mac_1g.sv   /home/jonathan/v7-johnson-demo/ethsoc/axis_gmii_rx.sv /home/jonathan/v7-johnson-demo/ethsoc/axis_gmii_tx.sv /home/jonathan/v7-johnson-demo/ethsoc/rgmii_lfsr.sv   /home/jonathan/v7-johnson-demo/ethsoc/dualmem_widen.sv /home/jonathan/v7-johnson-demo/ethsoc/dualmem_widen8.sv   /home/jonathan/v7-johnson-demo/ethsoc/pcs_pma_flat.v /home/jonathan/v7-johnson-demo/ethsoc/vc707_arp.v
synth_xilinx -top top -family xc7 -nowidelut
write_json /tmp/arp_pure.json
stat
