read_verilog -lib +/xilinx/cells_sim.v
read_verilog -lib +/xilinx/cells_xtra.v
read_verilog /home/jonathan/v7-johnson-demo/ethsoc/vc707_uartecho_netlist_y.v
hierarchy -top uartecho
flatten
clean
delete t:$scopeinfo
blackbox =* uartecho %d
stat
write_json /tmp/r0_uartecho.json
