read_verilog -lib +/xilinx/cells_sim.v
read_verilog -lib +/xilinx/cells_xtra.v
read_verilog /home/jonathan/v7-johnson-demo/ethsoc/vc707_uartstream_netlist_y.v
hierarchy -top uartstream
flatten
clean
delete t:$scopeinfo
blackbox =* uartstream %d
stat
write_json /tmp/r0_uartstream.json
